/*****************************************************************************
Copyright  : BGI
File name  : main.h
Description: 运行逻辑
Author     : lmj
Version    : 0.0.0.1
Date       : 完成日期
History    : 修 改 历 史 记 录 列 表 ， 每 条 修 改 记 录 应 包 括 修 改 日 期 、 修 改
者及修改内容简述。
*****************************************************************************/
#ifndef __MAIN_H
#define __MAIN_H


#include "stm32f10x.h"
#include "rtthread.h"



//宏定义----------------------------------------------------------------------//



//定义结构体--------------------------------------------------------------------//
//线程管理
//struct tagThreadMan
//{
//	rt_thread_t    receive_thread;
//	rt_thread_t    send_thread; 
//};


////消息队列管理
//struct tagRT_MqMan
//{
//	rt_mq_t    test_mq;  
//};


//声明变量----------------------------------------------------------------------//



//声明函数----------------------------------------------------------------------//




#endif


